system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     compInterFoam;

startFrom       latestTime;
startTime       0;
stopAt          endTime;
endTime         3e-10;

deltaT          5e-16;
adjustTimeStep  yes;
maxCo           0.07;
maxAlphaCo      0.07;
maxDeltaT       2e-13;            // allow growth after pulse
// optional runtime output verbosity
verbose         true;

writeControl    runTime;           // consistent spacing despite variable Δt
writeInterval   1e-11;             // write every 0.2 ns (keeps disk sane)
purgeWrite      120;            // retain a broader history
writeFormat     ascii;
writePrecision  10;
writeCompression on;
timeFormat      general;
timePrecision   12;
fileHandler     collated;

runTimeModifiable yes;

dynamicFvMesh   none;
/*
dynamicRefineFvMeshCoeffs
{
    field            alpha.metal;
    refineInterval   1;
    lowerRefineLevel 0.05;
    upperRefineLevel 0.98;
    unrefineLevel    0.001;
    nBufferLayers    1;
    maxRefinement    3;
    maxCells         4000000;
    correctFluxes    (phi none);
}
*/
// solver switches (kept as in your file)
useAdvancedInterfaceCapturing  true;
advancedInterfaceCapturing
{
    // thresholds (must match your transportProperties metal)
    meltingTemperature   meltingTemperature [0 0 0 1 0 0 0] 1941;
    vaporTemperature     vaporTemperature [0 0 0 1 0 0 0] 3560;

    // strength & stability
    pressureScale        1e5;      // nondim scale used in your model
    recoilMax            1e7;      // Pa cap moderated for stability
    clampRecoil          true;     // disable to remove cap
    scaleRecoilMax       true;     // scale cap with phase change
    recoilUpdateInterval 1;        // evaluate every step
    recoilTempOffset     0;      // K above melting point for activation
    alphaMin             0.01;
    alphaMax             0.99;
    phaseChangeTempOffset  10; 
}

// adaptive relaxation used in pEqn.H
relaxP            0.2;
targetResP        0.05;

// (keep your existing maxCo/maxAlphaCo)

enableTClamp                   true;
minT                           250;
maxT                           12000;

densityClamp                   true;
minDensity                     0.5;
maxDensity                     15000;

twoTemperatureProperties
{
    Ce  Ce [1 -1 -2 -1 0 0 0] 2.5e6;
    Cl  Cl [1 -1 -2 -1 0 0 0] 2.536e6;
    G   G  [1 -1 -3 -1 0 0 0] 3.0e16;
    energyTol 0.1; // relative energy change tolerance
}

functions
{
    fieldWrite
    {
        type              writeObjects;
        libs              ("libutilityFunctionObjects.so");
        objects           (Q_laser U T alpha.metal p_rgh);
        writeControl runTime;
        writeInterval 2e-10;     // match writeInterval above
    }

    probesTTM_fs
    {
        type            probes;
        libs            ("libsampling.so");
        fields          (Te Tl T p_rgh U alpha.metal);
        probeLocations  ((2.5e-05 7.95e-06 5e-06) (2.5e-05 8.02e-06 5e-06) (2.5e-05 1.20e-05 5e-06));
        writeControl    runTime;
        writeInterval   5e-14;    // 50 fs snapshots
        timeStart       0;
        timeEnd         1e-11;    // stop at 10 ps
    }
    probesTTM
    {
        type            probes;
        libs            ("libsampling.so");
        fields          (Te Tl T p_rgh U alpha.metal);
        probeLocations  ((2.5e-05 7.95e-06 5e-06) (2.5e-05 8.02e-06 5e-06) (2.5e-05 1.20e-05 5e-06));
        writeControl    runTime;
        writeInterval   1e-11;    // 10 ps
        timeStart       1e-11;    // start after the fs window
    }
    CourantNo
    {
        type CourantNo; libs ("libutilityFunctionObjects.so");
        writeControl runTime; writeInterval 1e-11;
    }

    fieldMinMax_T
    {
        type fieldMinMax; libs ("libfieldFunctionObjects.so");
        writeControl runTime; writeInterval 1e-11; fields (T);
    }

    fieldMinMax_alpha
    {
        type fieldMinMax; libs ("libfieldFunctionObjects.so");
        writeControl runTime; writeInterval 1e-11; fields (alpha.metal);
    }
}
