system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
scale 1e-6; // coordinates in micrometers

// Domain: x:[0,50] µm, z:[0,10] µm, y vertical (up)
// y-planes (12 µm gap): 0.0000, 8.0000, 8.0714, 20.0714
vertices
(
    // y0 = 0.0000 (donor glass bottom)
    (0   0.0000  0)  (50  0.0000  0)  (50  0.0000 10)  (0   0.0000 10)
    // y1 = 8.0000 (top of glass = bottom of Ti)
    (0   8.0000  0)  (50  8.0000  0)  (50  8.0000 10)  (0   8.0000 10)
    // y2 = 8.0714 (top of Ti) 71.4 nm
    (0   8.0714  0)  (50  8.0714  0)  (50  8.0714 10)  (0   8.0714 10)
    // y3 = 20.0714 (Ti top + 12 µm air gap)  ← top is the receiver wall
    (0  20.0714  0)  (50 20.0714  0)  (50 20.0714 10)  (0  20.0714 10)
);


blocks
(
    //                bottom (z=0)    top (z=10)         Nx   Ny  Nz
    hex ( 0  1  5  4   3  2  6  7)   (240  80  20)  simpleGrading (1 1 1)  // Glass
    hex ( 4  5  9  8   7  6 10 11)   (240   8  20)  simpleGrading (1 1 1)  // Ti film (8 cells across 71.4 nm)
    hex ( 8  9 13 12  11 10 14 15)   (240 120  20)  simpleGrading (1 1 1)  // Air gap (12 µm)
);
edges ();

boundary
(
  xMin { type symmetryPlane; faces ((0 3 7 4)(4 7 11 8)(8 11 15 12)); }
  xMax { type symmetryPlane; faces ((1 5 6 2)(5 9 10 6)(9 13 14 10)); }

  zMin { type symmetryPlane; faces ((0 1 5 4)(4 5 9 8)(8 9 13 12)); }
  zMax { type symmetryPlane; faces ((3 2 6 7)(7 6 10 11)(11 10 14 15)); }

  yMin { type wall;  faces ((0 1 2 3)); }         // donor glass bottom wall
  yMax { type wall;  faces ((12 13 14 15)); }     // receiver wall (top of air gap)
);

mergePatchPairs();
// ************************************************************************* //
