system/refineMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      refineMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
set                 focusBox;        // made by topoSet (non-empty)
coordinateSystem    global;          // use global x,y,z axes
globalCoeffs
{
    tan1   (1 0 0);   // x-direction
    tan2   (0 0 1);   // z-direction
    normal (0 1 0);   // y-direction (film thickness)  <-- do NOT refine
} 
// Split x and z only (leave y intact)
directions           (tan1 tan2);

useHexTopology      yes;
geometricCut        yes;             // preserves nicer splits on hexes
writeMesh           no;

nBufferLayers        0;
maxGlobalCells       30000000;
maxLocalCells        30000000;
minRefinementCells   0;

refinementRegions
{
  focusBox
  {
    mode    inside;
    levels  ((1e15 1));              // one split in each listed direction
  }
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
