system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: setFields dictionary                 |
|  \\    /   O peration     | Detailed init for LIFT test run                |
|   \\  /    A nd           |                                                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// Only numbers adjusted; no factors/models changed.
// Update the BOX LIMITS below to match your mesh (in meters).
// Coordinate convention: X,Z lateral, Y vertical (gravity in -Y).

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
defaultFieldValues
(
  volScalarFieldValue alpha.metal 0
  volScalarFieldValue alpha.air   1
);

regions
(
    boxToCell
    {
        // film slab: x: [0, 50 µm], y: [8.0000, 8.0714 µm], z: [0, 10 µm]
        box (0        8.0e-06  0)
            (5.0e-05  8.0714e-06  1.0e-05);

        fieldValues
        (
            volScalarFieldValue alpha.metal 1
            volScalarFieldValue alpha.air   0
        );
    }
);
